In [1]:
import pandas as pd

In [3]:
df = pd.read_csv(r'./student.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      object
 1   name    3 non-null      object
 2   age     4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [5]:
df.describe()

             age
count   4.000000
mean   27.500000
std    14.200939
min    11.000000
25%    19.250000
50%    27.500000
75%    35.750000
max    44.000000

In [6]:
df.head()

  id name  age
0  1    a   11
1  2    b   22
2  o    c   33
3  4  NaN   44

In [13]:
df['id'].str.isnumeric().sum()

np.int64(3)